rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/i2c.c
   /* Configure SDA specific settings for I2C */
   GPIO_InitStructure.GPIO_Pin = s_I2C_Bus[iBus].sda_pin;
   GPIO_Init(s_I2C_Bus[iBus].sda_port, &GPIO_InitStructure);

   /* 3. Set up common DMA I2C settings ------------------------------------- */
   DMA_Cmd( s_I2C_Bus[iBus].i2c_dma_rx_stream, DISABLE );
   DMA_DeInit( s_I2C_Bus[iBus].i2c_dma_rx_stream );

   DMA_Cmd( s_I2C_Bus[iBus].i2c_dma_tx_stream, DISABLE );
   DMA_DeInit( s_I2C_Bus[iBus].i2c_dma_tx_stream );

   /* Set up a common DMA structure */
//   DMA_InitStructure.DMA_Channel             = s_I2C_Bus[iBus].i2c_dma_channel;
//   DMA_InitStructure.DMA_PeripheralBaseAddr  = s_I2C_Bus[iBus].i2c_dma_dr_addr;
//   DMA_InitStructure.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;
//   DMA_InitStructure.DMA_MemoryInc           = DMA_MemoryInc_Enable;
//   DMA_InitStructure.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;
//   DMA_InitStructure.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;
//   DMA_InitStructure.DMA_Mode                = DMA_Mode_Normal;
//   DMA_InitStructure.DMA_Priority            = DMA_Priority_VeryHigh;
//   DMA_InitStructure.DMA_FIFOMode            = DMA_FIFOMode_Enable;
//   DMA_InitStructure.DMA_FIFOThreshold       = DMA_FIFOThreshold_Full;
//   DMA_InitStructure.DMA_MemoryBurst         = DMA_MemoryBurst_Single;
//   DMA_InitStructure.DMA_PeripheralBurst     = DMA_PeripheralBurst_Single;
//
//   /* Initialize the DMA RX stream */
//   DMA_InitStructure.DMA_DIR                 = DMA_DIR_PeripheralToMemory;
//   DMA_InitStructure.DMA_Memory0BaseAddr     = (uint32_t)s_I2C_Bus[iBus].pRxBuffer;
//   DMA_InitStructure.DMA_BufferSize          = s_I2C_Bus[iBus].nBytesExpected;
//   DMA_Init( s_I2C_Bus[iBus].i2c_dma_rx_stream, &DMA_InitStructure );
//
//   dbg_slow_printf("DMA1_St0 periphBaseAddr: 0x%08x and should be 0x%08x\n", DMA_InitStructure.DMA_PeripheralBaseAddr, (uint32_t)&(I2C1->DR));

   /* Initialize the DMA TX stream */
//   DMA_InitStructure.DMA_DIR                 = DMA_DIR_MemoryToPeripheral;
//   DMA_InitStructure.DMA_Memory0BaseAddr     = (uint32_t)s_I2C_Bus[iBus].pRxBuffer;
//   DMA_InitStructure.DMA_BufferSize          = s_I2C_Bus[iBus].nBytesExpected;
//   DMA_Init( s_I2C_Bus[iBus].i2c_dma_tx_stream, &DMA_InitStructure );


   /* 4. Set up interrupts -------------------------------------------------- */
   /* Set up Interrupt controller to handle I2C Event interrupts */
//   NVIC_Config(
//         s_I2C_Bus[iBus].i2c_ev_irq_num,
//         s_I2C_Bus[iBus].i2c_ev_irq_prio
//   );

   /* Set up Interrupt controller to handle I2C Error interrupts */
   NVIC_Config(
         s_I2C_Bus[iBus].i2c_er_irq_num,
         s_I2C_Bus[iBus].i2c_er_irq_prio
   );


   /* Enable the TransferComplete interrupt in the DMA */
//   DMA_ITConfig( s_I2C_Bus[iBus].i2c_dma_rx_stream, DMA_IT_TC | DMA_IT_HT | DMA_IT_TE | DMA_IT_FE | DMA_IT_DME, ENABLE );

   /* Enable All I2C Interrupts */
   I2C_ITConfig(
         s_I2C_Bus[iBus].i2c_bus,
         I2C_IT_ERR, //I2C_IT_EVT | I2C_IT_BUF |
         ENABLE
   );

   /* Initialize the IRQ and priorities for I2C DMA */
   NVIC_Config(
         s_I2C_Bus[iBus].i2c_dma_rx_irq_num,
         s_I2C_Bus[iBus].i2c_dma_rx_irq_prio
   );

//   NVIC_Config(
//         s_I2C_Bus[iBus].i2c_dma_tx_irq_num,
//         s_I2C_Bus[iBus].i2c_dma_tx_irq_prio
//   );


   /* I2C configuration */
   I2C_InitTypeDef  I2C_InitStructure;
   I2C_InitStructure.I2C_Mode                = I2C_Mode_I2C; /* Mode for the M24CXX EEPROM used by the STM324x9I-EVAL2 dev kit */
   I2C_InitStructure.I2C_DutyCycle           = I2C_DutyCycle_2;
   I2C_InitStructure.I2C_OwnAddress1         = s_I2C_Bus[iBus].i2c_cur_dev_addr;
   I2C_InitStructure.I2C_Ack                 = I2C_Ack_Enable;
   I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
   I2C_InitStructure.I2C_ClockSpeed          = s_I2C_Bus[iBus].i2c_bus_speed;

   /* Apply I2C configuration */
   I2C_Init( s_I2C_Bus[iBus].i2c_bus, &I2C_InitStructure );
   I2C_AcknowledgeConfig( s_I2C_Bus[iBus].i2c_bus, ENABLE );

   /* Configure I2C Filters */
   I2C_AnalogFilterCmd( s_I2C_Bus[iBus].i2c_bus, ENABLE );
   I2C_DigitalFilterConfig( s_I2C_Bus[iBus].i2c_bus, 0x0F );

   /* I2C Peripheral Enable */
//   I2C_Cmd( s_I2C_Bus[iBus].i2c_bus, ENABLE );

}

/******************************************************************************/
void I2C_SetDirection( I2C_Bus_t iBus,  uint8_t I2C_Direction )
{
   /* Check inputs */
   assert_param( IS_I2C_DIRECTION( I2C_Direction ) );
   assert_param( IS_I2C_BUS( iBus ) );

   s_I2C_Bus[iBus].bTransDirection = I2C_Direction;
}

/******************************************************************************/
uint8_t I2C_getDevAddrSize( I2C_Device_t iDev )
{
   /* Check inputs */
   assert_param( IS_I2C_DEVICE( iDev ) );

   return( s_I2C_Dev[iDev].i2c_mem_addr_size );
}

/******************************************************************************/
void I2C_DMARead( I2C_Bus_t iBus, uint16_t wReadAddr, uint16_t wReadLen )
{
   /* Check inputs */
   assert_param( IS_I2C_BUS( iBus ) );

   /* Set the structure buffer management for how many bytes to expect and how
    * many are currently there (none). */
   s_I2C_Bus[iBus].nBytesExpected = wReadLen;
   s_I2C_Bus[iBus].nBytesCurrent  = 0;
   s_I2C_Bus[iBus].nRxindex       = 0;

   /* Clear out the DMA settings */
   DMA_Cmd( s_I2C_Bus[iBus].i2c_dma_rx_stream, DISABLE );
   uint32_t tmpTimeout1 = 0xFFFF;
   while (
         (DISABLE != DMA_GetCmdStatus(s_I2C_Bus[iBus].i2c_dma_rx_stream)) &&
         (tmpTimeout1 != 0 )
   ) {
      --tmpTimeout1;
   }
   if ( tmpTimeout1 == 0 ) {
      DBG_printf("Couldn't disable DMA stream after %x cycles\n", tmpTimeout1);
   } else {
      DBG_printf("DMA1_St0 disabled after %x cycles\n", tmpTimeout1);
      DBG_printf("DMA1_St0 state is still %d\n", DMA_GetCmdStatus(s_I2C_Bus[iBus].i2c_dma_rx_stream));
   }

   DMA_DeInit( s_I2C_Bus[iBus].i2c_dma_rx_stream );

   /* Set up a new DMA structure for reading */
   DMA_InitStructure.DMA_Channel             = s_I2C_Bus[iBus].i2c_dma_channel;
   DMA_InitStructure.DMA_PeripheralBaseAddr  = s_I2C_Bus[iBus].i2c_dma_dr_addr;
   DMA_InitStructure.DMA_DIR                 = DMA_DIR_PeripheralToMemory;
   DMA_InitStructure.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;
   DMA_InitStructure.DMA_MemoryInc           = DMA_MemoryInc_Enable;
   DMA_InitStructure.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;
   DMA_InitStructure.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;
   DMA_InitStructure.DMA_Mode                = DMA_Mode_Normal;
   DMA_InitStructure.DMA_Priority            = DMA_Priority_VeryHigh;
   DMA_InitStructure.DMA_FIFOMode            = DMA_FIFOMode_Enable;
   DMA_InitStructure.DMA_FIFOThreshold       = DMA_FIFOThreshold_Full;
   DMA_InitStructure.DMA_MemoryBurst         = DMA_MemoryBurst_Single;
   DMA_InitStructure.DMA_PeripheralBurst     = DMA_PeripheralBurst_Single;
   DMA_InitStructure.DMA_Memory0BaseAddr     = s_I2C_Bus[iBus].pRxBuffer;
   DMA_InitStructure.DMA_BufferSize          = s_I2C_Bus[iBus].nBytesExpected;

   DBG_printf("Attempting to read via DMA %d bytes\n", DMA_InitStructure.DMA_BufferSize);

      /* Initialize the DMA with the filled in structure */
   DMA_Init( s_I2C_Bus[iBus].i2c_dma_rx_stream, &DMA_InitStructure );

   /* Enable the TransferComplete interrupt in the DMA */
   DMA_ITConfig( s_I2C_Bus[iBus].i2c_dma_rx_stream, DMA_IT_TC, ENABLE );

