rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/i2c.c
   /* Clear any pending flags on RX Stream */
   DMA_ClearFlag(
         s_I2C_Bus[iBus].i2c_dma_rx_stream,
         DMA_FLAG_TCIF0 |
         DMA_FLAG_FEIF0 |
         DMA_FLAG_DMEIF0 |
         DMA_FLAG_TEIF0 |
         DMA_FLAG_HTIF0
   );

   /* I2Cx DMA Enable */
   I2C_DMACmd( s_I2C_Bus[iBus].i2c_bus, ENABLE );

   /* Finally, activate DMA */
   DMA_Cmd( s_I2C_Bus[iBus].i2c_dma_rx_stream, ENABLE );

}

/**
 * @}
 * end addtogroup groupI2C
 */

/******************************************************************************/
void DMA1_Stream0_IRQHandler( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */
//   printf("\n\n DMA!!!\n\n");
   /* Test on DMA Stream Transfer Complete interrupt */
   if ( RESET != DMA_GetITStatus(DMA1_Stream0, DMA_IT_TCIF0) ) {
      /* Start of STM32 I2C HW bug workaround:
       * This is a workaround for the STM32 I2C hardware bug.  You have to send
       * the STOP bit before receiving the last byte.  In the case of DMA xfers,
       * this means doing it before you shut off the DMA stream.
       * See the STM32 errata for more details. - HR */
      DMA_Cmd( DMA1_Stream0, DISABLE );
//      I2C_AcknowledgeConfig( I2C1, DISABLE);        /* Disable Acknowledgment */

      I2C_GenerateSTOP(I2C1, ENABLE);                        /* Generate Stop */

      /* Wait for the byte to be received.
       * Note: There's really no way around waiting for this flag to be reset
       * outside of the ISR since you have to do this BEFORE you shut off DMA
       * which has to be done in this ISR. Thankfully, this flag gets reset
       * fairly quickly (189 times through the loop). - HR. */
//      uint16_t nI2CBusTimeout = MAX_I2C_TIMEOUT;
//      while(I2C_GetFlagStatus(I2C1, I2C_FLAG_RXNE) == RESET) {
//         if((nI2CBusTimeout--) == 0) {
//            ERR_printf("Timeout waiting for I2C Stop bit flag reset!\n");
//            return;
//         }
//      }

//      I2C_AcknowledgeConfig(I2C1, ENABLE);        /* Re-enable Acknowledgment */
      /* End of STM32 I2C HW bug workaround */

      /* Disable DMA so it doesn't keep outputting the buffer. */
//      DMA_Cmd( DMA1_Stream0, DISABLE );

      /* Publish event stating that the count has been reached */
      I2CDataEvt *i2cDataEvt = Q_NEW( I2CDataEvt, I2C_READ_DONE_SIG );
      i2cDataEvt->i2cDevice = s_I2C_Bus[I2CBus1].i2c_cur_dev;
      i2cDataEvt->wBufferLen = s_I2C_Bus[I2CBus1].nBytesExpected;
      MEMCPY(
            i2cDataEvt->buffer,
            s_I2C_Bus[I2CBus1].pRxBuffer,
            i2cDataEvt->wBufferLen
      );
      QF_PUBLISH( (QEvent *)i2cDataEvt, AO_SerialMgr );

//      DBG_printf("I2C DMA read done. nI2CBusTimeout was %d\n", nI2CBusTimeout);

      /* Clear DMA Stream Transfer Complete interrupt pending bit */
      DMA_ClearITPendingBit( DMA1_Stream0, DMA_IT_TCIF0 );
   }

   QK_ISR_EXIT();                           /* inform QK about exiting an ISR */
}

/******************************************************************************/
void I2C1_EV_IRQHandler( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */

   /* Get Last I2C Event */
   __IO uint32_t I2CEvent = I2C_GetLastEvent( I2C1 );

   /* Check which I2C device on this bus is being used */
   //   if ( EEPROM == s_I2C_Bus[I2CBus1].i2c_cur_dev ) {
   switch (I2CEvent) {
      //      case 0x00000000:
      //      case 0x00000001:
      //      case 0x00004001:
      //      case 0x00034044:
      //         /* This is the I2C "Event" that is always triggering so we explicitly
      //          * ignore it here */
      //         break;

      case I2C_EVENT_MASTER_MODE_SELECT: /* BUSY, MSL and SB flag */

         if ( I2C_GEN_START_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {
            /* Set new state */
            s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_MASTER_TX_MODE_SELECTED_ST;

            isr_dbg_slow_printf("Selecting master\n");
//            DBG_printf("Selecting master\n");
            /* Send slave Address for write */
            I2C_Send7bitAddress(
                  I2C1,                                  // This is always the bus used in this ISR
                  s_I2C_Bus[I2CBus1].i2c_cur_dev_addr,   // Look up the current device address for this bus
                  s_I2C_Bus[I2CBus1].bTransDirection     // Direction of data on this bus
            );
         } else if ( I2C_GEN_2ND_START_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {

            /* Set the direction to receive */
            I2C_SetDirection( I2CBus1,  I2C_Direction_Receiver);

            /* Send slave Address for read */
            I2C_Send7bitAddress(
                  I2C1,           /* This is always the bus used in this ISR */
                  s_I2C_Bus[I2CBus1].i2c_cur_dev_addr,  /* Look up the current device address for this bus */
                  s_I2C_Bus[I2CBus1].bTransDirection    /* Direction of data on this bus */
            );

            isr_dbg_slow_printf("Selecting master again\n");

//            DBG_printf("Selecting master again\n");
         }

         /* Create and publish event for I2CMgr */
//         QEvt *qEvt = Q_NEW( QEvt, I2C_EV_MASTER_MODE_SELECT_SIG );
//         QF_PUBLISH( (QEvt *)qEvt, AO_I2CMgr );

//         isr_dbg_slow_printf("I2C_EVENT_MASTER_MODE_SELECT\n");
         break;

      case I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED:
         isr_dbg_slow_printf("I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED\n");
//         DBG_printf("I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED\n");
         break;

      /* Check on EV6 */
      case I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED: /* BUSY, MSL, ADDR, TXE and TRA flags */
         isr_dbg_slow_printf("I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED\n");
//         DBG_printf("I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED\n");
         if ( I2C_MASTER_TX_MODE_SELECTED_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {

            /* 2 byte address for device */
            if ( 2 == I2C_getDevAddrSize(s_I2C_Bus[I2CBus1].i2c_cur_dev) ) {
            isr_dbg_slow_printf("MSB\n");

