rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/i2c.c
               /* Set new state */
               s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_SENT_MSB_ADDR_ST;

               /* Create and publish event for I2CMgr */
//            QEvt *qEvt1 = Q_NEW( QEvt, I2C_EV_MASTER_TX_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt1, AO_I2CMgr );

               /* Send the MSB of the address first to the I2C device */
               I2C_SendData(
                     I2C1,
                     (uint8_t)((s_I2C_Bus[I2CBus1].i2c_cur_dev_addr & 0xFF00) >> 8)
               );
            } else { /* Single byte address for device */
               isr_dbg_slow_printf("Single byte address\n");
               /* Set new state and use the LSB state so we can skip to the next
                * step */
               s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_SENT_LSB_ADDR_ST;

               /* Create and publish event for I2CMgr */
//            QEvt *qEvt1 = Q_NEW( QEvt, I2C_EV_MASTER_TX_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt1, AO_I2CMgr );

               /* Send the entire 1 byte address to the I2C device */
               I2C_SendData(
                     I2C1,
                     (uint8_t)((s_I2C_Bus[I2CBus1].i2c_cur_dev_addr & 0x00FF))
               );
            }

//            I2C_GetITStatus()
//            I2C_GetFlagStatus( I2C1, I2C_FLAG_MSL | I2C_FLAG_ADDR | I2C_FLAG_TXE | I2C_FLAG_TRA );
//            isr_dbg_slow_printf("I2C (before) MSL: %x, ADDR: %x, TXE: %x, TRA: %x\n",
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_MSL),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_ADDR),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TXE),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TRA)
//            );
//            I2C_SendData(I2C1, (uint8_t)((0x0000 & 0xFF00) >> 8));
//
//            isr_dbg_slow_printf("I2C (after) MSL: %x, ADDR: %x, TXE: %x, TRA: %x\n",
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_MSL),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_ADDR),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TXE),
//                  I2C_GetFlagStatus(I2C1, I2C_FLAG_TRA)
//            );
//
//            /*!< Test on EV8 and clear it */
//            uint16_t sEETimeout = 10000;
//            while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
////            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr msb\n");
//                  break;
//               }
//            }
//
//            /*!< Send the EEPROM's internal address to read from: LSB of the address */
//            I2C_SendData(I2C1, (uint8_t)(0x0000 & 0x00FF));
//            sEETimeout = 10000;
//            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr lsb\n");
//                  break;
//               }
//            }
//            isr_dbg_slow_printf("Sent addr\n");
         }



//            /*!< Send the EEPROM's internal address to read from: MSB of the address first */
//            I2C_SendData(I2C1, (uint8_t)((0x0000 & 0xFF00) >> 8));
//
//            /*!< Test on EV8 and clear it */
//            uint16_t sEETimeout = 10000;
//            while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr msb\n");
//               }
//            }
//
//            /*!< Send the EEPROM's internal address to read from: LSB of the address */
//            I2C_SendData(I2C1, (uint8_t)(0x0000 & 0x00FF));
//            sEETimeout = 10000;
//            while(I2C_GetFlagStatus(I2C1, I2C_FLAG_BTF) == RESET)
//            {
//               if((sEETimeout--) == 0) {
//                  isr_dbg_slow_printf("Timed out sending addr lsb\n");
//               }
//            }
//            isr_dbg_slow_printf("Sent addr\n");
/* Create and publish event for I2CMgr */
//            QEvt *qEvt = Q_NEW( QEvt, I2C_MSTR_MODE_SELECTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt, AO_I2CMgr );
         break;

         /* Check on EV8 */
      case I2C_EVENT_MASTER_BYTE_TRANSMITTING:
//         isr_dbg_slow_printf("I2C_EVENT_MASTER_BYTE_TRANSMITTING\n");
         break;

      case I2C_EVENT_MASTER_BYTE_TRANSMITTED:
         isr_dbg_slow_printf("I2C_EVENT_MASTER_BYTE_TRANSMITTED\n");

         if ( I2C_SENT_MSB_ADDR_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {

            /* Create and publish event for I2CMgr */
            QEvt *qEvt2 = Q_NEW( QEvt, I2C_SENT_MSB_ADDR_SIG );
            QF_PUBLISH( (QEvt *)qEvt2, AO_I2CMgr );

            /* Set new state */
            s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_SENT_LSB_ADDR_ST;

            /* Send the LSB of the address to the I2C device */
            I2C_SendData(
                  I2C1,
                  (uint8_t)(s_I2C_Bus[I2CBus1].i2c_cur_dev_addr & 0xFF00)
            );
            isr_dbg_slow_printf("Sent LSB\n");
         } else if ( I2C_SENT_LSB_ADDR_ST == s_I2C_Bus[I2CBus1].i2c_cur_st ) {
            isr_dbg_slow_printf("Ready to send second start\n");
            /* Set new state */
            s_I2C_Bus[I2CBus1].i2c_cur_st = I2C_GEN_2ND_START_ST;

            /* Send START condition */
            I2C_GenerateSTART( I2C1, ENABLE );
         }



/* Create and publish event for I2CMgr */
//            QEvt *qEvt1 = Q_NEW( QEvt, I2C_MSTR_BYTE_TRANSMITTED_SIG );
//            QF_PUBLISH( (QEvt *)qEvt1, AO_I2CMgr );
//
//         if (Tx_Idx == (uint8_t)NumberOfByteToTransmit) {
//            /* Send STOP condition */
//            I2C_GenerateSTOP(I2C1, ENABLE);
//            I2C_ITConfig(I2C1, I2C_IT_EVT | I2C_IT_BUF, DISABLE);
//         } else {
//            /* Transmit Data TxBuffer */
//            I2C_SendData(I2C1, TxBuffer[Tx_Idx++]);
//         }

         break;

