rost0031/STM32491-EVAL_QPC_FreeRTOS/src/bsp/bsp_shared/i2c/i2c.c
         //         case I2C_EVENT_MASTER_BYTE_RECEIVED:
         //            isr_dbg_slow_printf("I2C_EVENT_MASTER_BYTE_RECEIVED\n");
         //
         //            /* Read the byte received */
         //            s_I2C_Bus[I2CBus1].pRxBuffer[ s_I2C_Bus[I2CBus1].nRxindex++ ] = I2C_ReceiveData( I2C1 );
         //               ++s_I2C_Bus[I2CBus1].nBytesCurrent;
         //
         //               /* Start
         //                * This is a workaround for the STM32 I2C hardware bug.  You have
         //                * to send the STOP bit before receiving the last byte.  See the
         //                * STM32 errata for more details. */
         //               if ( 1 == s_I2C_Bus[I2CBus1].nBytesExpected - s_I2C_Bus[I2CBus1].nBytesCurrent) {
         //                  /* Disable Acknowledgment */
         //                  I2C_AcknowledgeConfig( I2C1, DISABLE );
         //
         //                  /* Send STOP Condition */
         //                  I2C_GenerateSTOP( I2C1, ENABLE );
         //               }/* End */
         //
         //               /* Check if all the expected bytes have been read in from the bus */
         //               if ( s_I2C_Bus[I2CBus1].nBytesExpected == s_I2C_Bus[I2CBus1].nBytesCurrent ) {
         //                  /* Create an event and fill it with the data from the RX buffer of the bus.*/
         //                  I2CDataEvt *qEvtI2CReadDone = Q_NEW( I2CDataEvt, I2C_READ_DONE_SIG );
         //                  qEvtI2CReadDone->i2cDevice = EEPROM;
         //                  qEvtI2CReadDone->wBufferLen = s_I2C_Bus[I2CBus1].nBytesCurrent;
         //                  MEMCPY(
         //                        qEvtI2CReadDone->buffer,
         //                        s_I2C_Bus[I2CBus1].pRxBuffer,
         //                        qEvtI2CReadDone->wBufferLen
         //                  );
         //                  QF_PUBLISH( (QEvt *)qEvtI2CReadDone, AO_I2CMgr );
         //               }
         //
         //               /* Re-Enable Acknowledgment to be ready for another reception */
         //               I2C_AcknowledgeConfig(I2C1, ENABLE);
         //
         //               break;
      default:
//         isr_dbg_slow_printf("dc: %08x\n", (unsigned int)I2CEvent);
         break;

   }
   //   }else {
   //      isr_dbg_slow_printf("Invalid I2C device selected: %d\n", s_I2C_Bus[I2CBus1].i2c_cur_dev );
   //   }

//   isr_dbg_slow_printf("I2C Event\n");
   QK_ISR_EXIT();                           /* inform QK about exiting an ISR */
}

/******************************************************************************/
void I2C1_ER_IRQHandler( void )
{
   QK_ISR_ENTRY();                         /* inform QK about entering an ISR */

   /* Read SR1 register to get I2C error */
   __IO uint16_t regVal = I2C_ReadRegister(I2C1, I2C_Register_SR1) & 0xFF00;
   if (regVal != 0x0000) {
      /* Clears error flags */
      I2C1->SR1 &= 0x00FF;

      isr_dbg_slow_printf("I2C Error: 0x%04x\n", regVal);
   }
   QK_ISR_EXIT();                           /* inform QK about exiting an ISR */
}

/******** Copyright (C) 2014 Datacard. All rights reserved *****END OF FILE****/
